; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=7, packages=17, locations=16, max_capacity=3, out_folder=training/easy, instance_id=98, seed=139

(define (problem transport-98)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c3)
    (capacity v3 c3)
    (capacity v4 c3)
    (capacity v5 c3)
    (capacity v6 c3)
    (capacity v7 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l1)
    (at p2 l11)
    (at p3 l9)
    (at p4 l12)
    (at p5 l5)
    (at p6 l9)
    (at p7 l8)
    (at p8 l10)
    (at p9 l16)
    (at p10 l5)
    (at p11 l11)
    (at p12 l1)
    (at p13 l6)
    (at p14 l11)
    (at p15 l12)
    (at p16 l3)
    (at p17 l4)
    (at v1 l9)
    (at v2 l1)
    (at v3 l1)
    (at v4 l15)
    (at v5 l10)
    (at v6 l2)
    (at v7 l8)
    (road l12 l10)
    (road l5 l4)
    (road l14 l16)
    (road l8 l3)
    (road l8 l6)
    (road l8 l12)
    (road l10 l12)
    (road l1 l9)
    (road l16 l7)
    (road l6 l11)
    (road l6 l8)
    (road l7 l16)
    (road l4 l5)
    (road l4 l8)
    (road l9 l1)
    (road l8 l14)
    (road l13 l1)
    (road l2 l7)
    (road l12 l8)
    (road l14 l8)
    (road l3 l8)
    (road l8 l4)
    (road l9 l6)
    (road l9 l15)
    (road l11 l6)
    (road l1 l13)
    (road l7 l2)
    (road l15 l9)
    (road l16 l14)
    (road l6 l9)
    (road l6 l16)
    (road l16 l6)
    (road l1 l4)
    (road l4 l1)
    (road l14 l15)
    (road l15 l14)
    (road l6 l12)
    (road l12 l6)
    (road l2 l12)
    (road l12 l2)
    (road l2 l11)
    (road l11 l2)
    (road l5 l12)
    (road l12 l5)
    (road l8 l10)
    (road l10 l8)
    (road l4 l16)
    (road l16 l4)
    (road l2 l15)
    (road l15 l2)
    (road l3 l16)
    (road l16 l3)
    (road l10 l13)
    (road l13 l10)
    (road l10 l16)
    (road l16 l10)
    (road l2 l6)
    (road l6 l2)
    (road l3 l11)
    (road l11 l3)
    (road l2 l10)
    (road l10 l2)
    (road l8 l16)
    (road l16 l8)
    (road l1 l6)
    (road l6 l1)
    (road l5 l7)
    (road l7 l5)
    (road l6 l13)
    (road l13 l6)
    (road l8 l9)
    (road l9 l8)
    (road l1 l3)
    (road l3 l1)
    (road l5 l14)
    (road l14 l5)
    (road l1 l14)
    (road l14 l1)
    (road l12 l15)
    (road l15 l12)
    (road l2 l5)
    (road l5 l2)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l1)
    (at p3 l13)
    (at p4 l7)
    (at p5 l4)
    (at p6 l2)
    (at p7 l6)
    (at p8 l6)
    (at p9 l2)
    (at p10 l10)
    (at p11 l15)
    (at p12 l15)
    (at p13 l12)
    (at p14 l16)
    (at p15 l4)
    (at p16 l13)
    (at p17 l12))))

; plan
1. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 0 of 17
2. (pick-up v1 l1 p1 c0 c1)
   deleted: (at p1 l1) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 17
3. (drive v1 l1 l6)
   deleted: (at v1 l1)
   added: (at v1 l6)
   goals met: 0 of 17
4. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 0 of 17
5. (drop v1 l2 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l2) (capacity v1 c1)
   goals met: 1 of 17
6. (drive v1 l2 l11)
   deleted: (at v1 l2)
   added: (at v1 l11)
   goals met: 1 of 17
7. (pick-up v1 l11 p2 c0 c1)
   deleted: (at p2 l11) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 17
8. (drive v1 l11 l6)
   deleted: (at v1 l11)
   added: (at v1 l6)
   goals met: 1 of 17
9. (drive v1 l6 l1)
   deleted: (at v1 l6)
   added: (at v1 l1)
   goals met: 1 of 17
10. (drop v1 l1 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l1) (capacity v1 c1)
   goals met: 2 of 17
11. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 2 of 17
12. (pick-up v1 l9 p3 c0 c1)
   deleted: (at p3 l9) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 17
13. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 2 of 17
14. (drive v1 l1 l13)
   deleted: (at v1 l1)
   added: (at v1 l13)
   goals met: 2 of 17
15. (drop v1 l13 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l13) (capacity v1 c1)
   goals met: 3 of 17
16. (drive v1 l13 l10)
   deleted: (at v1 l13)
   added: (at v1 l10)
   goals met: 3 of 17
17. (drive v1 l10 l12)
   deleted: (at v1 l10)
   added: (at v1 l12)
   goals met: 3 of 17
18. (pick-up v1 l12 p4 c0 c1)
   deleted: (at p4 l12) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 17
19. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 3 of 17
20. (drive v1 l2 l7)
   deleted: (at v1 l2)
   added: (at v1 l7)
   goals met: 3 of 17
21. (drop v1 l7 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l7) (capacity v1 c1)
   goals met: 4 of 17
22. (drive v1 l7 l5)
   deleted: (at v1 l7)
   added: (at v1 l5)
   goals met: 4 of 17
23. (pick-up v1 l5 p5 c0 c1)
   deleted: (at p5 l5) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 17
24. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 4 of 17
25. (drop v1 l4 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l4) (capacity v1 c1)
   goals met: 5 of 17
26. (drive v1 l4 l8)
   deleted: (at v1 l4)
   added: (at v1 l8)
   goals met: 5 of 17
27. (drive v1 l8 l9)
   deleted: (at v1 l8)
   added: (at v1 l9)
   goals met: 5 of 17
28. (pick-up v1 l9 p6 c0 c1)
   deleted: (at p6 l9) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 17
29. (drive v1 l9 l6)
   deleted: (at v1 l9)
   added: (at v1 l6)
   goals met: 5 of 17
30. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 5 of 17
31. (drop v1 l2 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l2) (capacity v1 c1)
   goals met: 6 of 17
32. (drive v1 l2 l12)
   deleted: (at v1 l2)
   added: (at v1 l12)
   goals met: 6 of 17
33. (drive v1 l12 l8)
   deleted: (at v1 l12)
   added: (at v1 l8)
   goals met: 6 of 17
34. (pick-up v1 l8 p7 c0 c1)
   deleted: (at p7 l8) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 17
35. (drive v1 l8 l6)
   deleted: (at v1 l8)
   added: (at v1 l6)
   goals met: 6 of 17
36. (drop v1 l6 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l6) (capacity v1 c1)
   goals met: 7 of 17
37. (drive v1 l6 l8)
   deleted: (at v1 l6)
   added: (at v1 l8)
   goals met: 7 of 17
38. (drive v1 l8 l10)
   deleted: (at v1 l8)
   added: (at v1 l10)
   goals met: 7 of 17
39. (pick-up v1 l10 p8 c0 c1)
   deleted: (at p8 l10) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 17
40. (drive v1 l10 l12)
   deleted: (at v1 l10)
   added: (at v1 l12)
   goals met: 7 of 17
41. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 7 of 17
42. (drop v1 l6 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l6) (capacity v1 c1)
   goals met: 8 of 17
43. (drive v1 l6 l16)
   deleted: (at v1 l6)
   added: (at v1 l16)
   goals met: 8 of 17
44. (pick-up v1 l16 p9 c0 c1)
   deleted: (at p9 l16) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 17
45. (drive v1 l16 l7)
   deleted: (at v1 l16)
   added: (at v1 l7)
   goals met: 8 of 17
46. (drive v1 l7 l2)
   deleted: (at v1 l7)
   added: (at v1 l2)
   goals met: 8 of 17
47. (drop v1 l2 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l2) (capacity v1 c1)
   goals met: 9 of 17
48. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 9 of 17
49. (pick-up v1 l5 p10 c0 c1)
   deleted: (at p10 l5) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 17
50. (drive v1 l5 l12)
   deleted: (at v1 l5)
   added: (at v1 l12)
   goals met: 9 of 17
51. (drive v1 l12 l10)
   deleted: (at v1 l12)
   added: (at v1 l10)
   goals met: 9 of 17
52. (drop v1 l10 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l10) (capacity v1 c1)
   goals met: 10 of 17
53. (drive v1 l10 l2)
   deleted: (at v1 l10)
   added: (at v1 l2)
   goals met: 10 of 17
54. (drive v1 l2 l11)
   deleted: (at v1 l2)
   added: (at v1 l11)
   goals met: 10 of 17
55. (pick-up v1 l11 p11 c0 c1)
   deleted: (at p11 l11) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 17
56. (drive v1 l11 l2)
   deleted: (at v1 l11)
   added: (at v1 l2)
   goals met: 10 of 17
57. (drive v1 l2 l15)
   deleted: (at v1 l2)
   added: (at v1 l15)
   goals met: 10 of 17
58. (drop v1 l15 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l15) (capacity v1 c1)
   goals met: 11 of 17
59. (drive v1 l15 l9)
   deleted: (at v1 l15)
   added: (at v1 l9)
   goals met: 11 of 17
60. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 11 of 17
61. (pick-up v1 l1 p12 c0 c1)
   deleted: (at p12 l1) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 17
62. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 11 of 17
63. (drive v1 l9 l15)
   deleted: (at v1 l9)
   added: (at v1 l15)
   goals met: 11 of 17
64. (drop v1 l15 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l15) (capacity v1 c1)
   goals met: 12 of 17
65. (drive v1 l15 l9)
   deleted: (at v1 l15)
   added: (at v1 l9)
   goals met: 12 of 17
66. (drive v1 l9 l6)
   deleted: (at v1 l9)
   added: (at v1 l6)
   goals met: 12 of 17
67. (pick-up v1 l6 p13 c0 c1)
   deleted: (at p13 l6) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 12 of 17
68. (drive v1 l6 l12)
   deleted: (at v1 l6)
   added: (at v1 l12)
   goals met: 12 of 17
69. (drop v1 l12 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l12) (capacity v1 c1)
   goals met: 13 of 17
70. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 13 of 17
71. (drive v1 l6 l11)
   deleted: (at v1 l6)
   added: (at v1 l11)
   goals met: 13 of 17
72. (pick-up v1 l11 p14 c0 c1)
   deleted: (at p14 l11) (capacity v1 c1)
   added: (in p14 v1) (capacity v1 c0)
   goals met: 13 of 17
73. (drive v1 l11 l6)
   deleted: (at v1 l11)
   added: (at v1 l6)
   goals met: 13 of 17
74. (drive v1 l6 l16)
   deleted: (at v1 l6)
   added: (at v1 l16)
   goals met: 13 of 17
75. (drop v1 l16 p14 c0 c1)
   deleted: (in p14 v1) (capacity v1 c0)
   added: (at p14 l16) (capacity v1 c1)
   goals met: 14 of 17
76. (drive v1 l16 l6)
   deleted: (at v1 l16)
   added: (at v1 l6)
   goals met: 14 of 17
77. (drive v1 l6 l12)
   deleted: (at v1 l6)
   added: (at v1 l12)
   goals met: 14 of 17
78. (pick-up v1 l12 p15 c0 c1)
   deleted: (at p15 l12) (capacity v1 c1)
   added: (in p15 v1) (capacity v1 c0)
   goals met: 14 of 17
79. (drive v1 l12 l8)
   deleted: (at v1 l12)
   added: (at v1 l8)
   goals met: 14 of 17
80. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 14 of 17
81. (drop v1 l4 p15 c0 c1)
   deleted: (in p15 v1) (capacity v1 c0)
   added: (at p15 l4) (capacity v1 c1)
   goals met: 15 of 17
82. (drive v1 l4 l8)
   deleted: (at v1 l4)
   added: (at v1 l8)
   goals met: 15 of 17
83. (drive v1 l8 l3)
   deleted: (at v1 l8)
   added: (at v1 l3)
   goals met: 15 of 17
84. (pick-up v1 l3 p16 c0 c1)
   deleted: (at p16 l3) (capacity v1 c1)
   added: (in p16 v1) (capacity v1 c0)
   goals met: 15 of 17
85. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 15 of 17
86. (drive v1 l1 l13)
   deleted: (at v1 l1)
   added: (at v1 l13)
   goals met: 15 of 17
87. (drop v1 l13 p16 c0 c1)
   deleted: (in p16 v1) (capacity v1 c0)
   added: (at p16 l13) (capacity v1 c1)
   goals met: 16 of 17
88. (drive v1 l13 l1)
   deleted: (at v1 l13)
   added: (at v1 l1)
   goals met: 16 of 17
89. (drive v1 l1 l4)
   deleted: (at v1 l1)
   added: (at v1 l4)
   goals met: 16 of 17
90. (pick-up v1 l4 p17 c0 c1)
   deleted: (at p17 l4) (capacity v1 c1)
   added: (in p17 v1) (capacity v1 c0)
   goals met: 16 of 17
91. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 16 of 17
92. (drive v1 l5 l12)
   deleted: (at v1 l5)
   added: (at v1 l12)
   goals met: 16 of 17
93. (drop v1 l12 p17 c0 c1)
   deleted: (in p17 v1) (capacity v1 c0)
   added: (at p17 l12) (capacity v1 c1)
   goals met: 17 of 17
